[
  {
    "date": "June 27, 2025",
    "excerpt": "COVER DESIGN REVEAL! I am absolutely in LOVE with my book cover for my debut novel, A Bloodveiled Descent, scheduled to release November 10th. Thank you so much @storywrappers for creating such a beau...",
    "image": "images/instagram/instagram-post-1-DLaJKKbOOXd.jpg",
    "link": "https://www.instagram.com/haleym.opet/p/DLaJKKbOOXd/",
    "content": "COVER DESIGN REVEAL! I am absolutely in LOVE with my book cover for my debut novel, A Bloodveiled Descent, scheduled to release November 10th. Thank you so much @storywrappers for creating such a beautiful design for Book One of The Solwyn Duology! This is a dark paranormal fantasy romance of fate, magic, and forbidden love. ❤️ Corsets off. Claws out. Fate made her wild…and desire made her reckless. #abloodveileddescent #forbiddenmagic #werewolfromance #slowburnfantasyromance #fatedmatesromance #regencyfantasyromance #enemiestolovers🔥"
  },
  {
    "date": "June 22, 2025",
    "excerpt": "FIRST Character Art Reveal!💜Created by the talented @mori_art.work \nIntroducing the clever and captivating Evelyne Duskwood, the middle daughter of the esteemed Lord and Lady of Caltheris. Thrust into...",
    "image": "images/instagram/instagram-post-2-DLNEpODOjZC.jpg",
    "link": "https://www.instagram.com/haleym.opet/p/DLNEpODOjZC/",
    "content": "FIRST Character Art Reveal!💜Created by the talented @mori_art.work \nIntroducing the clever and captivating Evelyne Duskwood, the middle daughter of the esteemed Lord and Lady of Caltheris. Thrust into the pressures of the Regency-era courting season, Evelyne reluctantly enters the social fray, only to catch the attention of her charming family friend, Alaric Stonebridge, the most sought-after bachelor in the realm. But Alaric’s intentions run deeper than flirtation, he must win her hand… or risk losing her forever when she uncovers the truth behind his motives.\n\nWhat begins as a light-hearted courtship quickly spirals into darkness when Evelyne’s younger brother is kidnapped by a powerful witch consumed by blood magic and commanding an army of blood-thirsty demons. As magic corrupts the world around them, Evelyne and Alaric are forced to fight not only for survival, but for their friendship. #abloodveileddescent #characterart #fantasyromancenovels #wolfromancenovel #regencyinspiredbook #darkfantasyart #darkfantasybooks"
  },
  {
    "date": "June 09, 2025",
    "excerpt": "!!! ATTENDING AUTHOR !!!\n\nHello my Little Grimmlins! Please give a wicked welcome to @haleym.opet who is joining us as an attending author at this event! Haley writes Paranormal Dark Romance Fantasy! ...",
    "image": "images/instagram/instagram-post-3-DKsmLjkyrU0.jpg",
    "link": "https://www.instagram.com/haleym.opet/p/DKsmLjkyrU0/",
    "content": "!!! ATTENDING AUTHOR !!!\n\nHello my Little Grimmlins! Please give a wicked welcome to @haleym.opet who is joining us as an attending author at this event! Haley writes Paranormal Dark Romance Fantasy! I am very excited to have her join us! Be sure to check out her socials before the big day! \n\nhttps://haleymopet.com/\n\n#bookstagram #talesasdarkastime2026 #booklovers #bookish #paranormalfantasybooks #paranormalromance"
  }
]